
"CONNECTION_ERROR_DESCRIPTION" = "Unable to Connect to Beanstalk Server";

"SERVER_ERROR_DESCRIPTION" = "A Bitbucket Server Error Occurred";
"SERVER_ERROR_FAILURE_REASON" = "An internal server error occured. Please try again later.";

"AUTHENTICATION_ERROR_DESCRIPTION" = "Authentication Failed With Beanstalk";
"AUTHENTICATION_ERROR_FAILURE_REASON" = "Authentication failed. Please verify your authentication information and try again.";

"RESOURCE_NOT_FOUND_ERROR_DESCRIPTION" = "Bitbucket API Resource Not Found";
"RESOURCE_NOT_FOUND_ERROR_FAILURE_REASON" = "The Bitbucket API resource could not be found.";

"RESPONSE_PARSER_ERROR_DESCRIPTION" = "A Bitbucket API Error Occurred";
"RESPONSE_PARSER_ERROR_FAILURE_REASON" = "There was an error parsing the response for the request. Please try again later.";

"API_ERROR_DESCRIPTION" = "A Beanstalk API Error Occurred";
